---
layout: default
title: Overworld RNG - Lead Ability And Dex Recommendations
permalink: /cfw/swsh/new-overworld/lead-ability-dex-rec
---

<div class="title" style="background-color: #0c0038;">
    <h1 class="text-light text-center pt-3 pb-3">Lead Ability &amp; DexRec</h1>
</div>
<small class="text-muted mb-3 mt-0">
    Understanding Pok&eacute;mon ability influences and Pok&eacute;dex recommendations to boost spawn rates.
</small>
<hr />

<p>This section explains advanced techniques involving the use of lead abilities and the using Pok&eacute;dex recommendation feature. These methods are used to influence the following:</p>

<ul>
    <li>The details of a spawned Pok&eacute;mon (e.g., nature and gender).</li>
    <li>The probability of spawning a particular Pok&eacute;mon in the encounter table.</li>
    <li>Increasing the likelihood of triggering a hidden encounter.</li>
</ul>

<p>This table provides information about each of the lead abilities and their use cases:</p>

<table class="table table-striped" style="width:100%" id="overworld-rng-table">
    <thead class="table text-white" style="background-color: #0c0038;">
        <tr>
            <th scope="col" class="text-center" style="width:30%">Ability</th>
            <th scope="col" class="text-center">Overworld Effect</th>
        </tr>
    </thead>
    <tbody>

        <tr>
            <td class="text-center"><span class="fw-bold">Synchronize</span></td>
            <td>
                The nature of the Synchronize Pok&eacute;mon will be applied to any encountered overworld Pok&eacute;mon. The Synchronize Pok&eacute;mon can be swapped into the lead <u>after</u> the Pok&eacute;mon has been spawned.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Cute Charm</span></td>
            <td>
                If your lead Pok&eacute;mon has this ability, increase the chance of that Pok&eacute;mon having the opposite gender.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Magnet Pull</span></td>
            <td>
                If there are STEEL TYPE Pok&eacute;mon in the encounter table, increase the chance of spawning those Pok&eacute;mon. Otherwise, do nothing.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Lightning Rod &amp; Static</span></td>
            <td>
                If there are ELECTRIC TYPE Pok&eacute;mon in the encounter table, increase the chance of spawning those Pok&eacute;mon. Otherwise, do nothing.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Flash Fire</span></td>
            <td>
                If there are FIRE TYPE Pok&eacute;mon in the encounter table, increase the chance of spawning those Pok&eacute;mon. Otherwise, do nothing.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Storm Drain</span></td>
            <td>
                If there are WATER TYPE Pok&eacute;mon in the encounter table, increase the chance of spawning those Pok&eacute;mon. Otherwise, do nothing.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Harvest</span></td>
            <td>
                If there are GRASS TYPE Pok&eacute;mon in the encounter table, increase the chance of spawning those Pok&eacute;mon. Otherwise, do nothing.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Compound Eyes &amp; Super Luck</span></td>
            <td>
                If the Pok&eacute;mon can be spawned holding a random held item, increase the likelihood of this occurring. Otherwise, do nothing.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Arena Trap, Illuminate &amp; No Guard</span></td>
            <td>
                INCREASE the chance of spawning a hidden encounter. These abilities are important to use when manipulating hidden encounters.
            </td>
        </tr>
        <tr>
            <td class="text-center"><span class="fw-bold">Quick Feet, Stench, White Smoke &amp; Infiltrator</span></td>
            <td>
                DECREASE the chance of spawning a hidden encounter. In most cases, these abilities should be avoided on your lead Pok&eacute;mon.
            </td>
        </tr>

    </tbody>
</table>

<div class="alert alert-danger" style="border: 1px solid #b60606; border-radius: 8px; padding: 15px; background-color: #f8d7da; color: #721c24;">
    Synchronize is the only ability usable after the Pok&eacute;mon spawns; all others must be active beforehand. A fainted lead allows your capture Pok&eacute;mon to enter battle directly, removing the need to consume a turn by switching the Pok&eacute;mon in.
</div>

<hr /><div class="title" style="background-color: #0c0038;">
    <h1 class="text-light text-center pt-3 pb-3">Pok&eacute;dex Recommendations</h1>
</div>
<small class="text-muted mb-3 mt-0">
    It is recommended to complete your Pok&eacute;dex before using this boosting method.
</small>
<hr />

<p>Upon opening the Pok&eacute;dex, you should see up to 4 Pok&eacute;mon at a specific location on the map. These Pok&eacute;mon have an increased spawn rate anywhere in the world as long as they are in the current encounter table. The order they are listed on the bottom right of the screen is from #1-#4 for the purpose of RNG manipulation. This feature is commonly referred to as "Pok&eacute;dex Recommendations" or "DexRec".</p>

<p>If you have not yet looked at your Pok&eacute;dex or the date has rolled over (either naturally or with date skipping) since the last time the Pok&eacute;dex was opened, the current DexRec is considered inactive until you look at the Pok&eacute;dex again.</p>

<div class="alert alert-danger" style="border: 1px solid #b60606; border-radius: 8px; padding: 15px; background-color: #f8d7da; color: #721c24;">
    For incomplete Pok&eacute;dexes, the recommendations you will see will prioritize Pok&eacute;mon that you have not yet captured. Completing the Pok&eacute;dex will cause the game to boost random Pok&eacute;mon. Thus, it is suggested to complete your Pok&eacute;dex before rolling DexRec.
</div>

<span class="fw-bold">Figure 1 -</span> DexRec Overview<p></p>
<img src="https://raw.githubusercontent.com/Billo-PS/billo-guides-images/refs/heads/main/cfw/swsh/overworld/lead-ability-dex-rec/dex-rec-example.jpg" alt="dex-rec-1" class="img-fluid clickable-image" data-image="https://raw.githubusercontent.com/Billo-PS/billo-guides-images/refs/heads/main/cfw/swsh/overworld/lead-ability-dex-rec/dex-rec-example.jpg"><p></p>

<div class="card border-dark">
    <div class="anchored card-header" style="background-color: #0c0038;" id="dexrec-overview">
        <span class="fw-bold text-light">DexRec Overview</span>
    </div>
    <div class="card-body card-bg">
        <p>In the above example, NidoranF (#1), Sinistea (#2), Heatmor (#3) and Magby (#4) are the currently boosted Pok&eacute;mon. Although the DexRec was triggered in Old Cemetery, these Pok&eacute;mon will have their spawn rate boosted globally regardless of the current area, as long as the boosted Pok&eacute;mon is present within the encounter table.</p>

        <p>Only the first form ID of a particular Pok&eacute;mon will be boosted. For example, if our currently boosted Pok&eacute;mon is Sinistea the spawn rate boost will only apply to the Phony form (the first form ID for Sinistea). This means that Antique Sinistea cannot have an encounter rate boost from DexRec at all.</p>

        <p>For Pok&eacute;mon can only be found in specific weather conditions, you will first need to find the location of your desired Pok&eacute;mon, then set the weather condition <u>in that area</u> to match the required weather needed to spawn the Pok&eacute;mon prior to opening the Pok&eacute;dex (example below). Owoow's <code span class="fw-bold">Encounter Lookup</code> feature can be used to quickly find details about a particular Pok&eacute;mon.</p>

        <details>
            <summary><span class="fw-bold">Example</span></summary>
            <p>If your desired DexRec is Drampa, which is found in the Lake of Outrage in Thunderstorm weather, you will need to change the current weather condition in the Lake of Outrage to Thunderstorm.</p>
        </details>

    </div>
</div>
<br />

<span class="fw-bold">Figure 2 -</span> Rolling For DexRec<p></p>
<img src="https://raw.githubusercontent.com/Billo-PS/billo-guides-images/refs/heads/main/cfw/swsh/overworld/lead-ability-dex-rec/dex-rolling.jpg" alt="dex-rec-2" class="img-fluid clickable-image" data-image="https://raw.githubusercontent.com/Billo-PS/billo-guides-images/refs/heads/main/cfw/swsh/overworld/lead-ability-dex-rec/dex-rolling.jpg"><p></p>

<div class="card border-dark">
    <div class="anchored card-header" style="background-color: #0c0038;" id="dexrec-rolling">
        <span class="fw-bold text-light">DexRec Rolling</span>
    </div>
    <div class="card-body card-bg">
        <h6 span class="fw-bold">Step-By-Step</h6>
        <ol>
            <li>Stand in any of the Wild Areas, then use the <code span class="fw-bold">Encounter Lookup</code> feature of owoow to search for your desired Pok&eacute;mon.</li>
            <p></p>
            <li>Take note of the location that contains your desired Pok&eacute;mon and the weather condition required to spawn it.</li>
            <p></p>
            <li>Change the date within the System Settings until you get the desired weather condition in at least one of the areas where your Pok&eacute;mon naturally spawns.</li>
            <p></p>
            <li>View the Pok&eacute;dex to activate your daily Pok&eacute;mon Recommendations. If you do not see what you want, exit to the overworld.</li>
            <p></p>
            <li>Use date skipping to reset daily events and the Pok&eacute;mon Recommendations. Make sure your weather conditions are correct again, then view the Pok&eacute;dex to generate new recommendations. Repeat until you have achieved your desired DexRec.</li>
        </ol>

        <h6 span class="fw-bold">About Date Skipping</h6>
        <p>DexRec is cleared after a day advances. You can change the date freely as long as you don't do the actual advance, but for obvious reasons, you cannot combine DexRec boosting and date skipping advancements.</p>

        <p>If you are not using date skipping, roll your desired DexRec and save the game. Take note of the date the game has been saved on to avoid unintentionally erasing the current recommendations due to natural time progression.</p>
    </div>
</div>
<br />

<div class="alert alert-danger" style="border: 1px solid #b60606; border-radius: 8px; padding: 15px; background-color: #f8d7da; color: #721c24;">
    DexRec rolling is deterministic. If you roll 100 days, then reset and roll another 100 days, you will see the same results both times. You should save after you have finished rolling even if you did not get your desired DexRec. Never reset the game back to before the date skipping occurred!
</div>
